
export const SUBJECTS = [
    "القرآن الكريم", "التربية الإسلامية", "اللغة العربية", "اللغة الإنجليزية", 
    "الرياضيات", "العلوم", "الكيمياء", "الفيزياء", "الأحياء", 
    "الاجتماعيات", "الحاسوب", "المكتبة", "الفنية", 
    "المختص الاجتماعي", "الأنشطة", "غيرها"
];

export const SUBJECT_BRANCHES: { [key: string]: string[] } = {
    "القرآن الكريم": ["حفظ وتفسير", "تجويد", "تلاوة"],
    "التربية الإسلامية": ["إيمان", "حديث", "فقه", "سيرة"],
    "اللغة العربية": ["نحو", "أدب", "نصوص", "بلاغة", "نقد", "قراءة"],
    "الرياضيات": ["جبر", "هندسة", "تفاضل وتكامل", "إحصاء"],
    "الاجتماعيات": ["تاريخ", "مجتمع", "جغرافيا", "وطنية"],
};

export const GRADES = [
    "التمهيدي", "الأول الابتدائي", "الثاني الابتدائي", "الثالث الابتدائي",
    "الرابع الابتدائي", "الخامس الابتدائي", "السادس الابتدائي", "السابع الأساسي",
    "الثامن الأساسي", "التاسع الأساسي", "الأول الثانوي", "الثاني الثانوي", "الثالث الثانوي"
];

export const SECTIONS = ['أ', 'ب', 'ج', 'د', 'هـ', 'و', 'ز', 'ح', 'ط', 'ي', 'ك'];

export const PERIODS = ["الصفرية", "الأولى", "الثانية", "الثالثة", "الرابعة", "الخامسة", "السادسة", "السابعة"];

export const DAYS = ["الأحد", "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت"];

export const INTRO_TYPES = ["سؤال", "قصة", "عصف ذهني", "لغز", "مراجعة", "تغذية راجعة للدرس السابق", "غيرها"];

export const TEACHING_METHODS = {
    "الطرق الأساسية": [
        "العصف الذهني", "لعب الأدوار", "دراسة الحالة", "التعلم الذاتي",
        "الاستقصاء العلمي", "حل المشكلات", "المناظرات الطلابية", "حكاية القصة (أو سرد القصة)"
    ],
    "استراتيجيات وأنشطة تفاعلية": [
        "التعلم المعكوس (الصف المقلوب)", "الاستماع النشط", "الكرسي الساخن",
        "أعواد المثلجات", "الرؤوس المرقمة", "فكر - زاوج - شارك", "حوض السمك"
    ]
};

export const TEACHING_AIDS = {
    "وسائل بصرية": [
        "البطاقات المصورة", "الملصقات", "العروض التقديمية (مثل البوربوينت)",
        "المجسمات", "الخرائط الذهنية", "اللوحات المغناطيسية", "الدمى التعليمية"
    ],
    "وسائل سمعية": [
        "التسجيلات الصوتية", "الأناشيد التعليمية", "القصص المسجلة", "البودكاست التعليمي"
    ],
    "وسائل سمعية بصرية": [
        "مقاطع الفيديو التعليمية", "الرسوم المتحركة", "اليوتيوب التعليمي", "الأفلام التعليمية"
    ],
    "وسائل رقمية": [
        "التطبيقات التعليمية", "الألعاب الإلكترونية التعليمية", "المواقع التعليمية", "المنصات الإلكترونية للتعلم"
    ]
};